---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendArcLength
source: html/d4cbf160-dcaf-5021-146a-37f5da8b5f48.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendArcLength

A constraint which can be applied to a RebarShapeSegment, and causes the segment
 to be replaced with a 180-degree arc. The associated parameter drives
 the arc length.

## Syntax (C#)
```csharp
public class RebarShapeConstraint180DegreeBendArcLength : RebarShapeConstraint
```